# *********************************************************************************************
# Title     : COREG model
# Function  : COREG
# Created by: Owner
# Created on: 2021/01/26
# URL       : https://dicits.ugr.es/software/SSLR/reference/COREG.html
# *********************************************************************************************


# ＜概要＞
# - コミッティベースの共訓練スタイルの半教師学習アルゴリズム


# ＜構文＞
# COREG(max.iter = 50, k1 = 3, k2 = 5, p1 = 3, p2 = 5, u = 100)


# ＜目次＞
# 0 モデリング


# 0 モデリング ----------------------------------------------------------------------------

library(SSLR)

m <- COREG(max.iter = 1)